/*
 * FM4- GPIO(0) emulation.
 *
 * Copyright (c) 2016 Liviu Ionescu.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#ifndef FM4_GPIO_H_
#define FM4_GPIO_H_

#include "qemu/osdep.h"
#include <hw/cortexm/fm4/capabilities.h>
#include <hw/cortexm/peripheral.h>
#include "exec/address-spaces.h"
//#include <hw/cortexm/gpio-lcd.h>
//#include <hw/cortexm/fm4/capabilities.h>

// ----------------------------------------------------------------------------

#define DEVICE_PATH_FM4_GPIO DEVICE_PATH_FM4 "GPIO"

// ----------------------------------------------------------------------------

// Note: the "port-index" property has type "int".
typedef enum {
    // TODO: keep this list in ascending order.
    FM4_PORT_GPIO = 0,
    FM4_PORT_GPIO_UNDEFINED = 0xFF,
} fm4_gpio_index_t;

// ----------------------------------------------------------------------------
#define FM4_GPIO_PIN_COUNT    (16)
#define FM4_ADC0_COUNT    (32)

#define FM4_IRQ_GPIO_IDR_IN         "idr-in"
#define FM4_IRQ_GPIO_ODR_OUT        "odr-out"
#define FM4_IRQ_GPIO_EXTI_OUT       "exti-out"

#define TYPE_FM4_GPIO TYPE_FM4_PREFIX "gpio" TYPE_PERIPHERAL_SUFFIX

// ----------------------------------------------------------------------------

// Parent definitions.
#define TYPE_FM4_GPIO_PARENT TYPE_PERIPHERAL
typedef PeripheralClass FM4GPIOParentClass;
typedef PeripheralState FM4GPIOParentState;

static bool TOUCH_XP_;
static bool TOUCH_YP_;
static int count = 0;  // the counter for trasfering 32 bits
static int x, y;
static int unit8_of_unit32 = 0;
static uint16_t  t_x_start, t_y_start, t_x_end, t_y_end;   //unit32
static uint32_t t;
static bool flag_state = false;
static uint8_t pixel_state;
static uint16_t color_;
bool get_TOUCH_X_();
bool get_TOUCH_Y_();
static bool pixel_or_rec = false;
// ----------------------------------------------------------------------------

// Class definitions.
#define FM4_GPIO_GET_CLASS(obj) \
    OBJECT_GET_CLASS(FM4GPIOClass, (obj), TYPE_FM4_GPIO)
#define FM4_GPIO_CLASS(klass) \
    OBJECT_CLASS_CHECK(FM4GPIOClass, (klass), TYPE_FM4_GPIO)

typedef struct {
    // private: 
    FM4GPIOParentClass parent_class;
    // public: 

    // None, so far.
} FM4GPIOClass;

// ----------------------------------------------------------------------------

// Instance definitions.
#define FM4_GPIO_STATE(obj) \
    OBJECT_CHECK(FM4GPIOState, (obj), TYPE_FM4_GPIO)

typedef struct {
    // private:
    FM4GPIOParentState parent_obj;
    // public:

    const FM4Capabilities *capabilities;

    // TODO: remove this if the peripheral is always enabled.
    // Points to the bitfield that enables the peripheral.
    Object *enabling_bit;

    // Remove it if there is only one port
    fm4_gpio_index_t port_index;



     // IRQs used to communicate with the machine implementation, for
    // cases like blinking a LED.
    // There is one IRQ for each pin.  Note that for pins configured
    // as inputs, the output IRQ state has no meaning.  Perhaps
    // the output should be updated to match the input in this case...
    qemu_irq odr_irq[FM4_GPIO_PIN_COUNT];

    qemu_irq odr_irq_lcd[FM4_GPIO_PIN_COUNT];


    
    // IRQs used to communicate with EXTI.
    qemu_irq exti_irq[FM4_GPIO_PIN_COUNT];

    // Cached direction mask. 1 = output pin.
    // No more than 16 bits/port.
    uint16_t dir_mask;
    uint16_t dir_mask1;


    union {
      // ----- 8< ----- 8< -----  8< ----- 8< ----- 8< ----- 8< ----- 8< -----

      // DO NOT REMOVE FIELDS! Automatically generated!
      // Merge fields from different family members.
      struct {
        // E2GPIO(0) registers.
        struct { 
          Object *pfr0; // 0x0(Port Function Setting Register 0) 
          Object *pfr1; // 0x4(Port Function Setting Register 1) 
          Object *pfr2; // 0x8(Port Function Setting Register 2) 
          Object *pfr3; // 0xC(Port Function Setting Register 3) 
          Object *pfr4; // 0x10(Port Function Setting Register 4) 
          Object *pfr5; // 0x14(Port Function Setting Register 5) 
          Object *pfr6; // 0x18(Port Function Setting Register 6) 
          Object *pfr7; // 0x1C(Port Function Setting Register 7) 
          Object *pfr8; // 0x20(Port Function Setting Register 8) 
          Object *pfr9; // 0x24(32) 
          Object *pfra; // 0x28(32) 
          Object *pfrb; // 0x2C(32) 
          Object *pfrc; // 0x30(32) 
          Object *pfrd; // 0x34(32) 
          Object *pfre; // 0x38(Port Function Setting Register E) 
          Object *pfrf; // 0x3C(32) 
          Object *pcr0; // 0x100(Pull-up Setting Register 0) 
          Object *pcr1; // 0x104(Pull-up Setting Register 1) 
          Object *pcr2; // 0x108(Pull-up Setting Register 2) 
          Object *pcr3; // 0x10C(Pull-up Setting Register 3) 
          Object *pcr4; // 0x110(Pull-up Setting Register 4) 
          Object *pcr5; // 0x114(Pull-up Setting Register 5) 
          Object *pcr6; // 0x118(Pull-up Setting Register 6) 
          Object *pcr7; // 0x11C(Pull-up Setting Register 7) 
          Object *pcr8; // 0x120(Pull-up Setting Register 8) 
          Object *pcr9; // 0x124(Pull-up Setting Register 9) 
          Object *pcra; // 0x128(Pull-up Setting Register A) 
          Object *pcrb; // 0x12C(Pull-up Setting Register B) 
          Object *pcrc; // 0x130(Pull-up Setting Register C) 
          Object *pcrd; // 0x134(Pull-up Setting Register D) 
          Object *pcre; // 0x138(Pull-up Setting Register E) 
          Object *pcrf; // 0x13C(Pull-up Setting Register F) 
          Object *ddr0; // 0x200(Port input/output Direction Setting Register 0) 
          Object *ddr1; // 0x204(Port input/output Direction Setting Register 1) 
          Object *ddr2; // 0x208(Port input/output Direction Setting Register 2) 
          Object *ddr3; // 0x20C(Port input/output Direction Setting Register 3) 
          Object *ddr4; // 0x210(Port input/output Direction Setting Register 4) 
          Object *ddr5; // 0x214(Port input/output Direction Setting Register 5) 
          Object *ddr6; // 0x218(Port input/output Direction Setting Register 6) 
          Object *ddr7; // 0x21C(Port input/output Direction Setting Register 7) 
          Object *ddr8; // 0x220(Port input/output Direction Setting Register 8) 
          Object *ddr9; // 0x224(Port input/output Direction Setting Register 9) 
          Object *ddra; // 0x228(Port input/output Direction Setting Register A) 
          Object *ddrb; // 0x22C(Port input/output Direction Setting Register B) 
          Object *ddrc; // 0x230(Port input/output Direction Setting Register C) 
          Object *ddrd; // 0x234(Port input/output Direction Setting Register D) 
          Object *ddre; // 0x238(Port input/output Direction Setting Register E) 
          Object *ddrf; // 0x23C(Port input/output Direction Setting Register F) 
          Object *pdir0; // 0x300(Port Input Data Register 0) 
          Object *pdir1; // 0x304(Port Input Data Register 1) 
          Object *pdir2; // 0x308(Port Input Data Register 2) 
          Object *pdir3; // 0x30C(Port Input Data Register 3) 
          Object *pdir4; // 0x310(Port Input Data Register 4) 
          Object *pdir5; // 0x314(Port Input Data Register 5) 
          Object *pdir6; // 0x318(Port Input Data Register 6) 
          Object *pdir7; // 0x31C(Port Input Data Register 7) 
          Object *pdir8; // 0x320(Port Input Data Register 8) 
          Object *pdir9; // 0x324(Port Input Data Register 9) 
          Object *pdira; // 0x328(Port Input Data Register A) 
          Object *pdirb; // 0x32C(Port Input Data Register B) 
          Object *pdirc; // 0x330(Port Input Data Register C) 
          Object *pdird; // 0x334(Port Input Data Register D) 
          Object *pdire; // 0x338(Port Input Data Register E) 
          Object *pdirf; // 0x33C(Port Input Data Register F) 
          Object *pdor0; // 0x400(Port Output Data Register 0) 
          Object *pdor1; // 0x404(Port Output Data Register 1) 
          Object *pdor2; // 0x408(Port Output Data Register 2) 
          Object *pdor3; // 0x40C(Port Output Data Register 3) 
          Object *pdor4; // 0x410(Port Output Data Register 4) 
          Object *pdor5; // 0x414(Port Output Data Register 5) 
          Object *pdor6; // 0x418(Port Output Data Register 6) 
          Object *pdor7; // 0x41C(Port Output Data Register 7) 
          Object *pdor8; // 0x420(Port Output Data Register 8) 
          Object *pdor9; // 0x424(Port Output Data Register 9) 
          Object *pdora; // 0x428(Port Output Data Register A) 
          Object *pdorb; // 0x42C(Port Output Data Register B) 
          Object *pdorc; // 0x430(Port Output Data Register C) 
          Object *pdord; // 0x434(Port Output Data Register D) 
          Object *pdore; // 0x438(Port Output Data Register E) 
          Object *pdorf; // 0x43C(Port Output Data Register F) 
          Object *ade; // 0x500(Analog Input Setting Register) 
          Object *spsr; // 0x580(Special Port Setting Register) 
          Object *epfr00; // 0x600(Extended Pin Function Setting Register 00) 
          Object *epfr01; // 0x604(Extended Pin Function Setting Register 01) 
          Object *epfr02; // 0x608(Extended Pin Function Setting Register 02) 
          Object *epfr03; // 0x60C(Extended Pin Function Setting Register 03) 
          Object *epfr04; // 0x610(Extended Pin Function Setting Register 04) 
          Object *epfr05; // 0x614(Extended Pin Function Setting Register 05) 
          Object *epfr06; // 0x618(Extended Pin Function Setting Register 06) 
          Object *epfr07; // 0x61C(Extended Pin Function Setting Register 07) 
          Object *epfr08; // 0x620(Extended Pin Function Setting Register 08) 
          Object *epfr09; // 0x624(Extended Pin Function Setting Register 09) 
          Object *epfr10; // 0x628(Extended Pin Function Setting Register 10) 
          Object *epfr11; // 0x62C(Extended Pin Function Setting Register 11) 
          Object *epfr12; // 0x630(Extended Pin Function Setting Register 12) 
          Object *epfr13; // 0x634(Extended Pin Function Setting Register 13) 
          Object *epfr14; // 0x638(Extended Pin Function Setting Register 14) 
          Object *epfr15; // 0x63C(Extended Pin Function Setting Register 15) 
          Object *epfr16; // 0x640(Extended Pin Function Setting Register 16) 
          Object *epfr17; // 0x644(Extended Pin Function Setting Register 17) 
          Object *epfr18; // 0x648(Extended Pin Function Setting Register 18) 
          Object *epfr19; // 0x64C(Extended Pin Function Setting Register 19) 
          Object *epfr20; // 0x650(Extended Pin Function Setting Register 20) 
          Object *epfr21; // 0x654(Extended Pin Function Setting Register 21) 
          Object *epfr22; // 0x658(Extended Pin Function Setting Register 22) 
          Object *epfr23; // 0x65C(Extended Pin Function Setting Register 23) 
          Object *epfr24; // 0x660(Extended Pin Function Setting Register 24) 
          Object *epfr25; // 0x664(Extended Pin Function Setting Register 25) 
          Object *epfr26; // 0x668(Extended Pin Function Setting Register 26) 
          Object *pzr0; // 0x700(Port Pseudo Open Drain Setting Register 0) 
          Object *pzr1; // 0x704(Port Pseudo Open Drain Setting Register 1) 
          Object *pzr2; // 0x708(Port Pseudo Open Drain Setting Register 2) 
          Object *pzr3; // 0x70C(Port Pseudo Open Drain Setting Register 3) 
          Object *pzr4; // 0x710(Port Pseudo Open Drain Setting Register 4) 
          Object *pzr5; // 0x714(Port Pseudo Open Drain Setting Register 5) 
          Object *pzr6; // 0x718(Port Pseudo Open Drain Setting Register 6) 
          Object *pzr7; // 0x71C(Port Pseudo Open Drain Setting Register 7) 
          Object *pzr8; // 0x720(Port Pseudo Open Drain Setting Register 8) 
          Object *pzr9; // 0x724(Port Pseudo Open Drain Setting Register 9) 
          Object *pzra; // 0x728(Port Pseudo Open Drain Setting Register A) 
          Object *pzrb; // 0x72C(Port Pseudo Open Drain Setting Register B) 
          Object *pzrc; // 0x730(Port Pseudo Open Drain Setting Register C) 
          Object *pzrd; // 0x734(Port Pseudo Open Drain Setting Register D) 
          Object *pzre; // 0x738(Port Pseudo Open Drain Setting Register E) 
          Object *pzrf; // 0x73C(Port Pseudo Open Drain Setting Register F) 
          Object *pdsr0; // 0x740(/dr) 
          Object *pdsr1; // 0x744(/dr) 
          Object *pdsr2; // 0x748(/dr) 
          Object *pdsr3; // 0x74C(/dr) 
          Object *pdsr4; // 0x750(/dr) 
          Object *pdsr5; // 0x754(/dr) 
          Object *pdsr6; // 0x758(/dr) 
          Object *pdsr7; // 0x75C(/dr) 
          Object *pdsr8; // 0x760(/dr) 
          Object *pdsr9; // 0x764(/dr) 
          Object *pdsra; // 0x768(/dr) 
          Object *pdsrb; // 0x76C(/dr) 
          Object *pdsrc; // 0x770(/dr) 
          Object *pdsrd; // 0x774(/dr) 
          Object *pdsre; // 0x778(/dr) 
          Object *pdsrf; // 0x77C(/dr) 
        } reg;

        struct { 

          // PFR0(Port Function Setting Register 0) bitfields.
          struct { 
            Object *p00; // [0:0] Bit0 of PFR0 
            Object *p01; // [1:1] Bit1 of PFR0            
            Object *p02; // [2:2] Bit2 of PFR0            
            Object *p03; // [3:3] Bit3 of PFR0            
            Object *p04; // [4:4] Bit4 of PFR0            
            Object *p08; // [8:8] Bit8 of PFR0            
            Object *p09; // [9:9] Bit9 of PFR0            
            Object *p0a; // [10:10] Bit10 of PFR0          
          } pfr0; 
           
          // PFR1(Port Function Setting Register 1) bitfields.
          struct { 
            Object *p10; // [0:0] Bit0 of PFR1            
            Object *p11; // [1:1] Bit1 of PFR1            
            Object *p12; // [2:2] Bit2 of PFR1            
            Object *p13; // [3:3] Bit3 of PFR1            
