/*
 * FM4- RTC(REAL-TIME CLOCK) emulation.
 *
 * Copyright (c) 2016 Liviu Ionescu.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#ifndef FM4_RTC_H_
#define FM4_RTC_H_

#include "qemu/osdep.h"

#include <hw/cortexm/peripheral.h>
#include <hw/cortexm/fm4/capabilities.h>

// ----------------------------------------------------------------------------

#define DEVICE_PATH_FM4_RTC DEVICE_PATH_FM4"RTC"


// ----------------------------------------------------------------------------

#define TYPE_FM4_RTC TYPE_FM4_PREFIX "rtc" TYPE_PERIPHERAL_SUFFIX

// ----------------------------------------------------------------------------

// Parent definitions.
#define TYPE_FM4_RTC_PARENT TYPE_PERIPHERAL
typedef PeripheralClass FM4RTCParentClass;
typedef PeripheralState FM4RTCParentState;

// ----------------------------------------------------------------------------

// Class definitions.
#define FM4_RTC_GET_CLASS(obj) \
    OBJECT_GET_CLASS(FM4RTCClass, (obj), TYPE_FM4_RTC)
#define FM4_RTC_CLASS(klass) \
    OBJECT_CLASS_CHECK(FM4RTCClass, (klass), TYPE_FM4_RTC)

typedef struct {
    // private: 
    FM4RTCParentClass parent_class;
    // public: 

    // None, so far.
} FM4RTCClass;

// ----------------------------------------------------------------------------

// Instance definitions.
#define FM4_RTC_STATE(obj) \
    OBJECT_CHECK(FM4RTCState, (obj), TYPE_FM4_RTC)

typedef struct {
    // private:
    FM4RTCParentState parent_obj;
    // public:

    const FM4Capabilities *capabilities;

    // TODO: remove this if the peripheral is always enabled.
    // Points to the bitfield that enables the peripheral.
    Object *enabling_bit;

    union {
      // ----- 8< ----- 8< -----  8< ----- 8< ----- 8< ----- 8< ----- 8< -----

      // DO NOT REMOVE FIELDS! Automatically generated!
      // Merge fields from different family members.
      struct {
        // E2RTC(REAL-TIME CLOCK) registers.
        struct { 
          Object *wtcr10; // 0x100(Control Register 10) 
          Object *wtcr11; // 0x104(Control Register 11) 
          Object *wtcr12; // 0x108(Control Register 12) 
          Object *wtcr13; // 0x10C(Control Register 13) 
          Object *wtcr20; // 0x110(Control Register 20) 
          Object *wtcr21; // 0x114(Control Register 21) 
          Object *wtsr; // 0x11C(Second Register) 
          Object *wtmir; // 0x120(Minute Register) 
          Object *wthr; // 0x124(Hour register) 
          Object *wtdr; // 0x128(Day Register) 
          Object *wtdw; // 0x12C(Day of the Week Register) 
          Object *wtmor; // 0x130(Month Register) 
          Object *wtyr; // 0x134(Year Register) 
          Object *almir; // 0x138(Alarm Minute Register) 
          Object *alhr; // 0x13C(Alarm Hour Register) 
          Object *aldr; // 0x140(Alarm Date Register) 
          Object *almor; // 0x144(Alarm Month Register) 
          Object *alyr; // 0x148(Alarm Years Register) 
          Object *wttr0; // 0x14C(Timer Setting Register 0) 
          Object *wttr1; // 0x150(Timer Setting Register 1) 
          Object *wttr2; // 0x154(Timer Setting Register 2) 
          Object *wtcal0; // 0x158(Frequency Correction Value Setting Register 0) 
          Object *wtcal1; // 0x15C(Frequency Correction Value Setting Register 1) 
          Object *wtcalen; // 0x160(Frequency Correction Enable Register) 
          Object *wtdiv; // 0x164(Division Ratio Setting Register) 
          Object *wtdiven; // 0x168(Divider Output Enable Register) 
          Object *wtcalprd; // 0x16C(Frequency Correction Period Setting Register) 
          Object *wtcosel; // 0x170(RTCCO Output Selection Register) 
          Object *vb_clkdiv; // 0x174(VB_CLKDIV Register) 
          Object *wtosccnt; // 0x178(WTOSCCNT Register) 
          Object *ccs; // 0x17C(CCS Register) 
          Object *ccb; // 0x180(CCB Register) 
          Object *boost; // 0x188(BOOST Register) 
          Object *ewkup; // 0x18C(EWKUP Register) 
          Object *vdet; // 0x190(VDET Register) 
          Object *hibrst; // 0x198(HIBRST Register) 
          Object *vbpfr; // 0x19C(Port Function Set Register) 
          Object *vbpcr; // 0x1A0(Pull-up Set Register) 
          Object *vbddr; // 0x1A4(Port I/O Direction Set Register) 
          Object *vbdir; // 0x1A8(Port Input Data Register) 
          Object *vbdor; // 0x1AC(Port Output Data Register) 
          Object *vbpzr; // 0x1B0(Port Pseudo-Open Drain Set Register) 
          Object *breg00; // 0x200(Backup Register) 
          Object *breg01; // 0x201(Backup Register) 
          Object *breg02; // 0x202(Backup Register) 
          Object *breg03; // 0x203(Backup Register) 
          Object *breg04; // 0x204(Backup Register) 
          Object *breg05; // 0x205(Backup Register) 
          Object *breg06; // 0x206(Backup Register) 
          Object *breg07; // 0x207(Backup Register) 
          Object *breg08; // 0x208(Backup Register) 
          Object *breg09; // 0x209(Backup Register) 
          Object *breg0a; // 0x20A(Backup Register) 
          Object *breg0b; // 0x20B(Backup Register) 
          Object *breg0c; // 0x20C(Backup Register) 
          Object *breg0d; // 0x20D(Backup Register) 
          Object *breg0e; // 0x20E(Backup Register) 
          Object *breg0f; // 0x20F(Backup Register) 
          Object *breg10; // 0x210(Backup Register) 
          Object *breg11; // 0x211(Backup Register) 
          Object *breg12; // 0x212(Backup Register) 
          Object *breg13; // 0x213(Backup Register) 
          Object *breg14; // 0x214(Backup Register) 
          Object *breg15; // 0x215(Backup Register) 
          Object *breg16; // 0x216(Backup Register) 
          Object *breg17; // 0x217(Backup Register) 
          Object *breg18; // 0x218(Backup Register) 
          Object *breg19; // 0x219(Backup Register) 
          Object *breg1a; // 0x21A(Backup Register) 
          Object *breg1b; // 0x21B(Backup Register) 
          Object *breg1c; // 0x21C(Backup Register) 
          Object *breg1d; // 0x21D(Backup Register) 
          Object *breg1e; // 0x21E(Backup Register) 
          Object *breg1f; // 0x21F(Backup Register) 
          Object *breg20; // 0x220(Backup Register) 
          Object *breg21; // 0x221(Backup Register) 
          Object *breg22; // 0x222(Backup Register) 
          Object *breg23; // 0x223(Backup Register) 
          Object *breg24; // 0x224(Backup Register) 
          Object *breg25; // 0x225(Backup Register) 
          Object *breg26; // 0x226(Backup Register) 
          Object *breg27; // 0x227(Backup Register) 
          Object *breg28; // 0x228(Backup Register) 
          Object *breg29; // 0x229(Backup Register) 
          Object *breg2a; // 0x22A(Backup Register) 
          Object *breg2b; // 0x22B(Backup Register) 
          Object *breg2c; // 0x22C(Backup Register) 
          Object *breg2d; // 0x22D(Backup Register) 
          Object *breg2e; // 0x22E(Backup Register) 
          Object *breg2f; // 0x22F(Backup Register) 
          Object *breg30; // 0x230(Backup Register) 
          Object *breg31; // 0x231(Backup Register) 
          Object *breg32; // 0x232(Backup Register) 
          Object *breg33; // 0x233(Backup Register) 
          Object *breg34; // 0x234(Backup Register) 
          Object *breg35; // 0x235(Backup Register) 
          Object *breg36; // 0x236(Backup Register) 
          Object *breg37; // 0x237(Backup Register) 
          Object *breg38; // 0x238(Backup Register) 
          Object *breg39; // 0x239(Backup Register) 
          Object *breg3a; // 0x23A(Backup Register) 
          Object *breg3b; // 0x23B(Backup Register) 
          Object *breg3c; // 0x23C(Backup Register) 
          Object *breg3d; // 0x23D(Backup Register) 
          Object *breg3e; // 0x23E(Backup Register) 
          Object *breg3f; // 0x23F(Backup Register) 
          Object *breg40; // 0x240(Backup Register) 
          Object *breg41; // 0x241(Backup Register) 
          Object *breg42; // 0x242(Backup Register) 
          Object *breg43; // 0x243(Backup Register) 
          Object *breg44; // 0x244(Backup Register) 
          Object *breg45; // 0x245(Backup Register) 
          Object *breg46; // 0x246(Backup Register) 
          Object *breg47; // 0x247(Backup Register) 
          Object *breg48; // 0x248(Backup Register) 
          Object *breg49; // 0x249(Backup Register) 
          Object *breg4a; // 0x24A(Backup Register) 
          Object *breg4b; // 0x24B(Backup Register) 
          Object *breg4c; // 0x24C(Backup Register) 
          Object *breg4d; // 0x24D(Backup Register) 
          Object *breg4e; // 0x24E(Backup Register) 
          Object *breg4f; // 0x24F(Backup Register) 
          Object *breg50; // 0x250(Backup Register) 
          Object *breg51; // 0x251(Backup Register) 
          Object *breg52; // 0x252(Backup Register) 
          Object *breg53; // 0x253(Backup Register) 
          Object *breg54; // 0x254(Backup Register) 
          Object *breg55; // 0x255(Backup Register) 
          Object *breg56; // 0x256(Backup Register) 
          Object *breg57; // 0x257(Backup Register) 
          Object *breg58; // 0x258(Backup Register) 
          Object *breg59; // 0x259(Backup Register) 
          Object *breg5a; // 0x25A(Backup Register) 
          Object *breg5b; // 0x25B(Backup Register) 
          Object *breg5c; // 0x25C(Backup Register) 
          Object *breg5d; // 0x25D(Backup Register) 
          Object *breg5e; // 0x25E(Backup Register) 
          Object *breg5f; // 0x25F(Backup Register) 
          Object *breg60; // 0x260(Backup Register) 
          Object *breg61; // 0x261(Backup Register) 
          Object *breg62; // 0x262(Backup Register) 
          Object *breg63; // 0x263(Backup Register) 
          Object *breg64; // 0x264(Backup Register) 
          Object *breg65; // 0x265(Backup Register) 
          Object *breg66; // 0x266(Backup Register) 
          Object *breg67; // 0x267(Backup Register) 
          Object *breg68; // 0x268(Backup Register) 
          Object *breg69; // 0x269(Backup Register) 
          Object *breg6a; // 0x26A(Backup Register) 
          Object *breg6b; // 0x26B(Backup Register) 
          Object *breg6c; // 0x26C(Backup Register) 
          Object *breg6d; // 0x26D(Backup Register) 
          Object *breg6e; // 0x26E(Backup Register) 
          Object *breg6f; // 0x26F(Backup Register) 
          Object *breg70; // 0x270(Backup Register) 
          Object *breg71; // 0x271(Backup Register) 
          Object *breg72; // 0x272(Backup Register) 
          Object *breg73; // 0x273(Backup Register) 
          Object *breg74; // 0x274(Backup Register) 
          Object *breg75; // 0x275(Backup Register) 
          Object *breg76; // 0x276(Backup Register) 
          Object *breg77; // 0x277(Backup Register) 
          Object *breg78; // 0x278(Backup Register) 
          Object *breg79; // 0x279(Backup Register) 
          Object *breg7a; // 0x27A(Backup Register) 
          Object *breg7b; // 0x27B(Backup Register) 
          Object *breg7c; // 0x27C(Backup Register) 
          Object *breg7d; // 0x27D(Backup Register) 
          Object *breg7e; // 0x27E(Backup Register) 
          Object *breg7f; // 0x27F(Backup Register) 
        } reg;

        struct { 

          // WTCR10(Control Register 10) bitfields.
          struct { 
            Object *st; // [0:0] Start bit            
            Object *run; // [2:2] RTC count block operation bit            
            Object *srst; // [3:3] RTC reset bit            
            Object *scst; // [4:4] 1-second clock output stop bit            
            Object *scrst; // [5:5] Sub second generation/1-second generation counter reset bit            
            Object *busy; // [6:6] Busy bit            
            Object *trans; // [7:7] Transfer flag bit          
            } wtcr10; 

          // WTCR11(Control Register 11) bitfields.
          struct { 
            Object *mien; // [0:0] Alarm minute register enable bit            
            Object *hen; // [1:1] Alarm hour register enable bit            
            Object *den; // [2:2] Alarm day register enable bit            
